function config(map)
    MapCanSavePos(map, 0)
    MapCanPK(map, 1)
    MapCanTeam( map, 0 )
    MapType( map , 3 )
    MapCopyNum(map, 1)
    SingleMapCopyPlyNum(map, 300)
    --MapCanTeam(map , 1)
    MapCanStall(map , 0)
	--	SetCopySpecialInter(map_copy, 1000)
end

function get_map_entry_pos_magicsea2()

	local POS_X = 1370
	local POS_Y = 532
	return POS_X, POS_Y

end

function init_entry(map)
	SetMapEntryMapName(map, "darkblue")
-- Установка времени работы карты
-- 2020/02/23/1/0 (год/месяц/день/часы/минуты) - время начала работы карты
-- 0/1/0  (день/час/минута) - время открытия портала (открываем ежечасно)
-- 0/0/30 (день/час/минута) - время работы портала (портал работает 30 минут)
-- 0/0/45 (день/час/минута) - время работы карты (карта работает 45 минут)
	SetMapEntryTime( map, "2020/02/23/0/0", "0/1/0", "0/0/30", "0/0/45" )
end

function map_run_magicsea2(map)
	
end

function can_open_entry_magicsea2(map)
	if (Open_portal_chaos == 3) then
		local Now_Time = GetNowTime()
		if Now_Time == 14 or Now_Time == 20 then
			return 1
		else
			return 0
		end
	else
		return 0
	end
end

function after_enter_magicsea2(role, map_copy)

end

function before_leave_magicsea2(role)
	
end	

function map_copy_run_magicsea2(map_copy)
		
end

function map_copy_run_special_magicsea2(map_copy) 
	local Magic_players = GetMapActivePlayer(map_copy)
	Notice( "\194 \213\224\238\241\229 \216\224\233\242\224\237\224 "..Magic_players.." \226\251\230\232\226\248\232\245!" )
	--Notice( "В Хаосе Шайтана "..Magic_players.." выживших!" )
	Magic_5_minute = Magic_5_minute+1

	if (Magic_5_minute == 2) then
		--Сундук Хаоса нач. ур. (ID 859)
		for i = 1, 14, 1 do 
			local angle = math.random(1,360)
			local x, y = ShaitanPos1(i)
			local Monster = CreateChaEx(859, x, y, angle, 60, map_copy)
				SetChaLifeTime(Monster, 298050)
		end
		--Notice("\213\224\238\241 \216\224\233\242\224\237\224: \211\226\224\230\224\229\236\251\229 \239\232\240\224\242\251, \239\238\255\226\232\235\232\241\252 \241\243\237\228\243\234\232 \239\229\240\226\238\227\238 \243\240\238\226\237\255!")
		--Notice("Хаос Шайтана: Уважаемые пираты, появились сундуки первого уровня!")
		
		GM_Chat('\211\226\224\230\224\229\236\251\229 \239\232\240\224\242\251, \239\238 \239\238\241\235\229\228\237\232\236 \241\238\238\225\249\229\237\232\229\236 \226 \213\224\238\241\229 \238\241\242\224\235\238\241\252 '..Magic_players..' '..phrase_no_dead(Magic_players)..', \224 \242\224\234 \230\229 \238 \239\238\255\226\235\229\237\232\232 \241\243\237\228\243\234\238\226 \245\224\238\241\224 \237\224\247\224\235\252\237\238\227\238 \243\240\238\226\229\237\255!')
		--GM_Chat('Уважаемые пираты, по последним сообщением в Хаосе осталось '..Magic_players..' '..phrase_no_dead(Magic_players)..', а так же о появлении сундуков хаоса начального уровеня!')
	end
	
	if (Magic_5_minute == 3) then
		--Сундук Хаоса стандартный ур. (ID 860
		for i = 1, 7, 1 do 
			local angle = math.random(1,360)
			local x, y = ShaitanPos2(i)
			local Monster = CreateChaEx(860, x, y, angle, 60, map_copy)
				SetChaLifeTime(Monster, 298050)
		end
		--Notice("\213\224\238\241 \216\224\233\242\224\237\224: \211\226\224\230\224\229\236\251\229 \239\232\240\224\242\251, \239\238\255\226\232\235\232\241\252 \241\243\237\228\243\234\232 \226\242\238\240\238\227\238 \243\240\238\226\237\255!")
		--Notice("Хаос Шайтана: Уважаемые пираты, появились сундуки второго уровня!")
		
		GM_Chat('\211\226\224\230\224\229\236\251\229 \239\232\240\224\242\251, \239\238 \239\238\241\235\229\228\237\232\236 \241\238\238\225\249\229\237\232\229\236 \226 \213\224\238\241\229 \238\241\242\224\235\238\241\252 '..Magic_players..' '..phrase_no_dead(Magic_players)..', \224 \242\224\234 \230\229 \238 \239\238\255\226\235\229\237\232\232 \241\243\237\228\243\234\238\226 \245\224\238\241\224 \241\242\224\237\228\224\240\242\237\238\227\238 \243\240\238\226\229\237\255!')	
		--GM_Chat('Уважаемые пираты, по последним сообщением в Хаосе осталось '..Magic_players..' '..phrase_no_dead(Magic_players)..', а так же о появлении сундуков хаоса стандартного уровеня!')
	end
	
	if (Magic_5_minute == 4) then
		--Сундук Хаоса эксперт ур. (ID 861)
		for i = 1, 7, 1 do 
			local angle = math.random(1,360)
			local x, y = ShaitanPos3(i)
			local Monster = CreateChaEx(861, x, y, angle, 60, map_copy)
				SetChaLifeTime(Monster, 298050)
		end
		--Notice("\213\224\238\241 \216\224\233\242\224\237\224: \211\226\224\230\224\229\236\251\229 \239\232\240\224\242\251, \239\238\255\226\232\235\232\241\252 \241\243\237\228\243\234\232 \242\240\229\242\252\229\227\238 \243\240\238\226\237\255!")
		--Notice("Хаос Шайтана: Уважаемые пираты, появились сундуки третьего уровня!")
	
		GM_Chat('\211\226\224\230\224\229\236\251\229 \239\232\240\224\242\251, \239\238 \239\238\241\235\229\228\237\232\236 \241\238\238\225\249\229\237\232\229\236 \226 \213\224\238\241\229 \238\241\242\224\235\238\241\252 '..Magic_players..' '..phrase_no_dead(Magic_players)..', \224 \242\224\234 \230\229 \238 \239\238\255\226\235\229\237\232\232 \241\243\237\228\243\234\238\226 \245\224\238\241\224 \226\251\241\238\234\238\227\238 \243\240\238\226\229\237\255!')
		--GM_Chat('Уважаемые пираты, по последним сообщением в Хаосе осталось '..Magic_players..' '..phrase_no_dead(Magic_players)..', а так же о появлении сундуков хаоса высокого уровеня!')
	end
	
	-- Новайс мобы
	if (Magic_5_minute == 5) then
		for i = 1, 141, 1 do
			local monster_id = {868,872,875,879}
			local x, y = ShaitanPosMonster(i)
			local Monster = CreateChaEx(monster_id[math.random(1,4)], x, y, math.random(1,360), 60, map_copy)
				SetChaLifeTime(Monster, 298050)
		end
		--Notice("\213\224\238\241 \216\224\233\242\224\237\224: \194\238\231\240\224\228\232\235\232\241\252 \212\224\237\242\238\236\251 \232 \207\240\232\231\240\224\234\232...")
		--Notice("Хаос Шайтана: Возрадились Фантомы и Призраки...")
	
		GM_Chat('\211\226\224\230\224\229\236\251\229 \239\232\240\224\242\251, \239\238 \239\238\241\235\229\228\237\232\236 \241\238\238\225\249\229\237\232\229\236 \226 \213\224\238\241\229 \238\241\242\224\235\238\241\252 '..Magic_players..' '..phrase_no_dead(Magic_players)..', \224 \242\224\234 \230\229 \238 \239\238\255\226\235\229\237\232\232 \212\224\237\242\238\236\238\226 \232 \207\240\232\231\240\224\234\238\226 \237\224\247\224\235\252\237\238\227\238 \243\240\238\226\237\255!')
		--GM_Chat('Уважаемые пираты, по последним сообщением в Хаосе осталось '..Magic_players..' '..phrase_no_dead(Magic_players)..', а так же о появлении Фантомов и Призраков начального уровня!')
	end
	
	-- Мобы с первой профой
	if (Magic_5_minute == 6) then
		for i = 1, 141, 1 do
			local monster_id = {869,873,876,880}
			local x, y = ShaitanPosMonster(i)
			local Monster = CreateChaEx(monster_id[math.random(1,4)], x, y, math.random(1,360), 60, map_copy)
				SetChaLifeTime(Monster, 298050)
		end
		--Notice("\213\224\238\241 \216\224\233\242\224\237\224: \194\238\231\240\224\228\232\235\232\241\252 \212\224\237\242\238\236\251, \226\239\229\240\229\228! \194 \224\242\224\234\243!")
		--Notice("Хаос Шайтана: Возрадились Фантомы, вперед! В атаку!")
		
		GM_Chat('\211\226\224\230\224\229\236\251\229 \239\232\240\224\242\251, \239\238 \239\238\241\235\229\228\237\232\236 \241\238\238\225\249\229\237\232\229\236 \226 \213\224\238\241\229 \238\241\242\224\235\238\241\252 '..Magic_players..' '..phrase_no_dead(Magic_players)..', \224 \242\224\234 \230\229 \238 \239\238\255\226\235\229\237\232\232 \212\224\237\242\238\236\238\226!')
		--GM_Chat('Уважаемые пираты, по последним сообщением в Хаосе осталось '..Magic_players..' '..phrase_no_dead(Magic_players)..', а так же о появлении Фантомов!')
	end
	
	-- НГ мобы
	if (Magic_5_minute == 7) then
		for i = 1, 200, 1 do
			local monster_id = {870,874,877,881}
			local x, y = ShaitanPosMonster(i)
			local Monster = CreateChaEx(monster_id[math.random(1,4)], x, y, math.random(1,360), 60, map_copy)
				SetChaLifeTime(Monster, 298050)
		end
		--Notice("\213\224\238\241 \216\224\233\242\224\237\224: \194\238\231\240\224\228\232\235\232\241\252 \207\240\232\231\240\224\234\232, \225\243\228\252\242\229 \238\241\242\238\240\238\230\237\229\233...")
		--Notice("Хаос Шайтана: Возрадились Призраки, будьте осторожней...")
		
		GM_Chat('\211\226\224\230\224\229\236\251\229 \239\232\240\224\242\251, \239\238 \239\238\241\235\229\228\237\232\236 \241\238\238\225\249\229\237\232\229\236 \226 \213\224\238\241\229 \238\241\242\224\235\238\241\252 '..Magic_players..' '..phrase_no_dead(Magic_players)..', \224 \242\224\234 \230\229 \238 \239\238\255\226\235\229\237\232\232 \207\240\232\231\240\224\234\238\226!')
		--GM_Chat('Уважаемые пираты, по последним сообщением в Хаосе осталось '..Magic_players..' '..phrase_no_dead(Magic_players)..', а так же о появлении Призраков!')
	end
	
	-- БД Мобы
	if (Magic_5_minute == 8) then
		for i = 1, 258, 1 do
			local monster_id = {883,884,885,886}
			local x, y = ShaitanPosMonster(i)
			local Monster = CreateChaEx(monster_id[math.random(1,4)], x, y, math.random(1,360), 60, map_copy)
				SetChaLifeTime(Monster, 298050)
		end
		--Notice("\213\224\238\241 \216\224\233\242\224\237\224: \193\229\240\229\227\232\242\229\241\252 \239\232\240\224\242\251! \207\238\255\226\232\235\232\241\252 \241\238\240\224\242\237\232\234\232 \215\229\240\237\238\227\238 \196\240\224\234\238\237\224!")
		--Notice("Хаос Шайтана: Берегитесь пираты! Появились соратники Черного Дракона!")
	
		GM_Chat('\211\226\224\230\224\229\236\251\229 \239\232\240\224\242\251, \239\238 \239\238\241\235\229\228\237\232\236 \241\238\238\225\249\229\237\232\229\236 \226 \213\224\238\241\229 \238\241\242\224\235\238\241\252 '..Magic_players..' '..phrase_no_dead(Magic_players)..', \224 \242\224\234 \230\229 \238 \239\238\255\226\235\229\237\232\232 \241\238\240\224\242\237\232\234\238\226 \215\229\240\237\238\227\238 \196\240\224\234\238\237\224!')
		--GM_Chat('Уважаемые пираты, по последним сообщением в Хаосе осталось '..Magic_players..' '..phrase_no_dead(Magic_players)..', а так же о появлении соратников Черного Дракона!')
	end
	
	if (Magic_5_minute == 9) then
		--Notice("\213\224\238\241 \216\224\233\242\224\237\224: \209\232\235\251 \245\224\238\241\224 \238\242\241\242\243\239\224\254\242! \194 \225\224\237\234\229 \213\224\238\241\224 \241\234\238\239\232\235\238\241\252 ["..Magic_prize_money.."] \231\238\235\238\242\224. \202\242\238 \230\229 \231\224\225\229\240\229\242 \241\229\225\229 \237\224\227\240\224\228\243?")
		--Notice("Хаос Шайтана: Силы хаоса отступают! В банке Хаоса скопилось ["..Magic_prize_money.."] золота. Кто же заберет себе награду?")
		
		GM_Chat('\211\226\224\230\224\229\236\251\229 \239\232\240\224\242\251, \241\232\235\251 \245\224\238\241\224 \238\242\241\242\243\239\224\254\242! \194 \225\224\237\234\229 \213\224\238\241\224 \241\234\238\239\232\235\238\241\252 ['..Magic_prize_money..'] \231\238\235\238\242\224. \202\242\238 \230\229 \232\231 '..Magic_players..' \232\227\240\238\234\238\226 \231\224\225\229\240\229\242 \241\229\225\229 \237\224\227\240\224\228\243?')
		--GM_Chat('Уважаемые пираты, силы хаоса отступают! В банке Хаоса скопилось ['..Magic_prize_money..'] золота. Кто же из '..Magic_players..' игроков заберет себе награду?')
	end
end

function map_run_magicsea2(map_copy)

end

function map_copy_before_close_magicsea2(map_copy)
	Magic_players = GetMapActivePlayer(map_copy)
	if Magic_players > 0 then
		DealAllActivePlayerInMap(map_copy,"GiveSpecItemMagic")
	end
	Magic_players = 0
	Magic_5_minute = 0
	Magic_prize_money = 500000
	
	-- Установим значение, для открытия порталов Хаоса
	--	1: Хаос Аргента
	--	2: Хаос Шайтана
	--	3: Хаос Шайтана
	Open_portal_chaos = math.random(1, 3)
end

function map_copy_close_magicsea2(map_copy)
	ClearAllSubMapCha(map_copy)
end

function GiveSpecItemMagic(role)
	if Magic_players == 0 then
		GM_Chat('\213\238-\245\238-\245\238, \226 \253\242\238\236 \225\238\254 \239\238\225\229\228\232\235\232 \236\238\237\241\242\240\251...')
		--GM_Chat('Хо-хо-хо, в этом бою победили монстры...')
		return
	end
	
	local Money_magicsea2 = math.floor(Magic_prize_money/Magic_players)
	
	if Magic_players > 5 then
		AddMoney (role, 0, Money_magicsea2)
		--SystemNotice(role, "\209\229\227\238\228\237\255 \226 \225\238\254 \225\251\235\238 "..Magic_players.." \226\251\230\232\226\248\232\245, \234\224\230\228\251\233 \232\231 \237\232\245 \239\238\235\243\247\224\229\242 \239\238 $"..Money_magicsea2.."!")
		--SystemNotice(role, "Сегодня в бою было "..Magic_players.." выживших, каждый из них получает по $"..Money_magicsea2.."!")
		
		GM_Chat('\209\229\227\238\228\237\255 \226 \225\238\254 \225\251\235\238 '..Magic_players..' \226\251\230\232\226\248\232\245, \234\224\230\228\251\233 \232\231 \237\232\245 \239\238\235\243\247\224\229\242 \239\238 $'..Money_magicsea2..'!')
		--GM_Chat('Сегодня в бою было '..Magic_players..' выживших, каждый из них получает по $'..Money_magicsea2..'!')
		return
	end

	if Magic_players < 6 and Magic_players > 1 then
		local Item_CanGet = GetChaFreeBagGridNum(role)
		if Item_CanGet <= 0 then
			GiveItemX(role, 0, 1031, 1, 4)
		else
			GiveItem(role, 0, 1031, 1, 4)
		end
		AddMoney(role, 0, Money_magicsea2 )
		--SystemNotice(role, "\213\224\238\241 \216\224\233\242\224\237\224: \209\229\227\238\228\237\255 \226 \225\238\254 \225\251\235\238 "..Magic_players.." \226\251\230\232\226\248\232\245, \234\224\230\228\251\233 \232\231 \237\232\245 \239\238\235\243\247\224\229\242 \239\238 $"..Money_magicsea2.." \232 \239\238 \232 1 \209\226\255\242\238\233 \253\236\225\235\229\236\238\233 \234\238\235\252\246\224!")
		--SystemNotice(role, "Хаос Шайтана: Сегодня в бою было "..Magic_players.." выживших, каждый из них получает по $"..Money_magicsea2.." и по и 1 Святой эмблемой кольца!")
		
		GM_Chat('\209\229\227\238\228\237\255 \226 \225\238\254 \225\251\235\238 '..Magic_players..' \226\251\230\232\226\248\232\245, \234\224\230\228\251\233 \232\231 \237\232\245 \239\238\235\243\247\224\229\242 \239\238 $'..Money_magicsea2..' \232 \239\238 \232 1 \209\226\255\242\238\233 \253\236\225\235\229\236\238\233 \234\238\235\252\246\224!')
		--GM_Chat('Сегодня в бою было '..Magic_players..' выживших, каждый из них получает по $'..Money_magicsea2..' и по и 1 Святой эмблемой кольца!')
		return
	end
	
	if Magic_players == 1 then
		local Item_CanGet = GetChaFreeBagGridNum(role)
		if Item_CanGet <= 0 then
			GiveItemX(role, 0, 1032, 1, 4)
		else
			GiveItem(role , 0, 1032, 1, 4)
		end
		AddMoney(role, 0, Money_magicsea2)
		local cha_name = GetChaDefaultName(role)
		--Notice("\213\224\238\241 \216\224\233\242\224\237\224: \197\228\232\237\241\242\226\229\237\237\251\236 \226\251\230\232\226\248\232\236 \226 \241\229\227\238\228\237\255\248\237\229\236 \225\238\254 \255\226\235\255\229\242\241\255 "..cha_name.." \206\237 \239\238\235\243\247\232\235 $"..Money_magicsea2.." \232 1 \253\236\225\235\229\236\243 \202\238\240\238\235\255 \202\238\235\252\246\224!")
		--Notice("Хаос Шайтана: Единственным выжившим в сегодняшнем бою является "..cha_name.." Он получил $"..Money_magicsea2.." и 1 эмблему Короля Кольца!")
		
		GM_Chat('\197\228\232\237\241\242\226\229\237\237\251\236 \226\251\230\232\226\248\232\236 \226 \241\229\227\238\228\237\255\248\237\229\236 \225\238\254 \255\226\235\255\229\242\241\255 '..cha_name..' \206\237 \239\238\235\243\247\232\235 $'..Money_magicsea2..' \232 1 \253\236\225\235\229\236\243 \202\238\240\238\235\255 \202\238\235\252\246\224!')
		--GM_Chat('Единственным выжившим в сегодняшнем бою является '..cha_name..' Он получил $'..Money_magicsea2..' и 1 эмблему Короля Кольца!')
		return
	end
end

function ShaitanPos1(str)
	local pos = {}
		pos[1] = {155,164}
		pos[2] = {115,110}
		pos[3] = {198,118}
		pos[4] = {152,127}
		pos[5] = {203,158}
		pos[6] = {196,181}
		pos[7] = {116,179}
		pos[8] = {151,199}
		pos[9] = {191,216}
		pos[10] = {116,269}
		pos[11] = {139,230}
		pos[12] = {176,240}
		pos[13] = {194,276}
		pos[14] = {160,258}
	return math.ceil(pos[str][1]*100), math.ceil(pos[str][2]*100)
end

function ShaitanPos2(str)
	local pos = {}
		pos[1] = {174,177}
		pos[2] = {190,216}
		pos[3] = {134,229}
		pos[4] = {164,259}
		pos[5] = {149,109}
		pos[6] = {192,133}
		pos[7] = {122,165}
	return math.ceil(pos[str][1]*100), math.ceil(pos[str][2]*100)
end

function ShaitanPos3(str)
	local pos = {}
		pos[1] = {206,181}
		pos[2] = {118,111}
		pos[3] = {116,259}
		pos[4] = {124,163}
		pos[5] = {151,198}
		pos[6] = {190,110}
		pos[7] = {196,260}
	return math.ceil(pos[str][1]*100), math.ceil(pos[str][2]*100)
end

function ShaitanPosMonster(str)
	local pos = {}
		pos[1] = {119,116}
		pos[2] = {105,66}
		pos[3] = {124,65}
		pos[4] = {144,66}
		pos[5] = {162,67}
		pos[6] = {194,69}
		pos[7] = {212,70}
		pos[8] = {230,69}
		pos[9] = {231,98}
		pos[10] = {231,130}
		pos[11] = {236,130}
		pos[12] = {225,156}
		pos[13] = {228,189}
		pos[14] = {225,190}
		pos[15] = {221,207}
		pos[16] = {235,224}
		pos[17] = {227,250}
		pos[18] = {235,255}
		pos[19] = {100,247}
		pos[20] = {94,238}
		pos[21] = {111,269}
		pos[22] = {106,70}
		pos[23] = {126,69}
		pos[24] = {160,71}
		pos[25] = {196,68}
		pos[26] = {232,66}
		pos[27] = {231,94}
		pos[28] = {230,126}
		pos[29] = {230,154}
		pos[30] = {226,181}
		pos[31] = {223,206}
		pos[32] = {228,217}
		pos[33] = {234,244}
		pos[34] = {197,104}
		pos[35] = {195,109}
		pos[36] = {204,129}
		pos[37] = {201,126}
		pos[38] = {202,132}
		pos[39] = {187,105}
		pos[40] = {181,131}
		pos[41] = {184,131}
		pos[42] = {153,123}
		pos[43] = {156,130}
		pos[44] = {154,93}
		pos[45] = {150,93}
		pos[46] = {147,114}
		pos[47] = {147,105}
		pos[48] = {143,118}
		pos[49] = {120,109}
		pos[50] = {114,107}
		pos[51] = {125,107}
		pos[52] = {114,136}
		pos[53] = {102,134}
		pos[54] = {102,139}
		pos[55] = {130,134}
		pos[56] = {132,119}
		pos[57] = {125,139}
		pos[58] = {130,160}
		pos[59] = {123,150}
		pos[60] = {118,163}
		pos[61] = {134,143}
		pos[62] = {148,138}
		pos[63] = {148,158}
		pos[64] = {152,149}
		pos[65] = {183,149}
		pos[66] = {185,152}
		pos[67] = {191,145}
		pos[68] = {145,162}
		pos[69] = {200,149}
		pos[70] = {203,152}
		pos[71] = {204,170}
		pos[72] = {207,170}
		pos[73] = {178,169}
		pos[74] = {172,189}
		pos[75] = {161,189}
		pos[76] = {160,178}
		pos[77] = {188,180}
		pos[78] = {196,190}
		pos[79] = {188,196}
		pos[80] = {179,194}
		pos[81] = {190,213}
		pos[82] = {185,211}
		pos[83] = {169,201}
		pos[84] = {163,217}
		pos[85] = {158,203}
		pos[86] = {146,200}
		pos[87] = {147,186}
		pos[88] = {140,178}
		pos[89] = {115,172}
		pos[90] = {102,163}
		pos[91] = {113,200}
		pos[92] = {93,167}
		pos[93] = {110,193}
		pos[94] = {135,194}
		pos[95] = {137,197}
		pos[96] = {122,186}
		pos[97] = {106,221}
		pos[98] = {114,225}
		pos[99] = {116,237}
		pos[100] = {87,256}
		pos[101] = {114,253}
		pos[102] = {123,251}
		pos[103] = {122,261}
		pos[104] = {115,275}
		pos[105] = {116,279}
		pos[106] = {117,304}
		pos[107] = {115,301}
		pos[108] = {123,269}
		pos[109] = {136,256}
		pos[110] = {136,260}
		pos[111] = {147,250}
		pos[112] = {160,257}
		pos[113] = {173,251}
		pos[114] = {197,252}
		pos[115] = {135,213}
		pos[116] = {126,201}
		pos[117] = {101,189}
		pos[118] = {124,219}
		pos[119] = {132,226}
		pos[120] = {136,235}
		pos[121] = {158,231}
		pos[122] = {169,222}
		pos[123] = {180,239}
		pos[124] = {184,239}
		pos[125] = {190,259}
		pos[126] = {197,266}
		pos[127] = {195,271}
		pos[128] = {194,291}
		pos[129] = {195,281}
		pos[130] = {173,267}
		pos[131] = {176,265}
		pos[132] = {162,268}
		pos[133] = {159,267}
		pos[134] = {162,279}
		pos[135] = {160,284}
		pos[136] = {162,294}
		pos[137] = {160,297}
		pos[138] = {160,310}
		pos[139] = {198,223}
		pos[140] = {189,223}
		pos[141] = {94,105}
		pos[142] = {209,189}
		pos[143] = {200,202}
		pos[144] = {213,202}
		pos[145] = {208,215}
		pos[146] = {210,226}
		pos[147] = {210,239}
		pos[148] = {195,235}
		pos[148] = {209,250}
		pos[149] = {208,263}
		pos[150] = {218,264}
		pos[151] = {219,249}
		pos[152] = {220,242}
		pos[153] = {218,231}
		pos[154] = {220,219}
		pos[155] = {231,199}
		pos[156] = {236,213}
		pos[157] = {229,234}
		pos[158] = {226,262}
		pos[159] = {204,285}
		pos[160] = {212,281}
		pos[161] = {210,274}
		pos[162] = {198,236}
		pos[163] = {177,224}
		pos[164] = {227,169}
		pos[165] = {217,161}
		pos[166] = {219,151}
		pos[167] = {211,139}
		pos[168] = {220,129}
		pos[169] = {207,113}
		pos[170] = {211,98}
		pos[171] = {216,88}
		pos[172] = {225,79}
		pos[173] = {99,274}
		pos[174] = {87,276}
		pos[175] = {88,266}
		pos[176] = {95,261}
		pos[177] = {103,265}
		pos[178] = {99,254}
		pos[179] = {127,238}
		pos[180] = {147,265}
		pos[181] = {226,139}
		pos[182] = {232,116}
		pos[183] = {232,105}
		pos[184] = {232,79}
		pos[185] = {181,67}
		pos[186] = {172,69}
		pos[187] = {137,71}
		pos[188] = {96,76}
		pos[189] = {104,79}
		pos[190] = {115,90}
		pos[191] = {102,94}
		pos[192] = {116,79}
		pos[193] = {128,79}
		pos[194] = {142,78}
		pos[195] = {153,78}
		pos[196] = {167,77}
		pos[197] = {180,78}
		pos[198] = {198,79}
		pos[199] = {212,78}
		pos[200] = {216,105}
		pos[201] = {224,94}
		pos[202] = {102,108}
		pos[203] = {97,118}
		pos[204] = {107,122}
		pos[205] = {94,147}
		pos[206] = {99,154}
		pos[207] = {104,173}
		pos[208] = {91,187}
		pos[209] = {97,200}
		pos[210] = {93,210}
		pos[211] = {107,209}
		pos[212] = {95,216}
		pos[213] = {98,226}
		pos[214] = {106,236}
		pos[215] = {109,151}
		pos[216] = {141,222}
		pos[217] = {154,221}
		pos[218] = {145,208}
		pos[219] = {165,242}
		pos[220] = {146,241}
		pos[221] = {135,246}
		pos[222] = {148,259}
		pos[223] = {157,247}
		pos[224] = {166,248}
		pos[225] = {182,255}
		pos[226] = {176,210}
		pos[227] = {174,176}
		pos[228] = {167,165}
		pos[229] = {162,155}
		pos[230] = {162,145}
		pos[231] = {173,144}
		pos[232] = {174,155}
		pos[233] = {160,103}
		pos[234] = {170,102}
		pos[235] = {176,109}
		pos[236] = {169,117}
		pos[237] = {161,116}
		pos[238] = {167,93}
		pos[239] = {178,92}
		pos[240] = {191,92}
		pos[241] = {202,95}
		pos[242] = {130,98}
		pos[243] = {139,92}
		pos[244] = {137,110}
		pos[245] = {96,86}
		pos[246] = {190,120}
		pos[247] = {171,131}
		pos[248] = {162,133}
		pos[249] = {138,131}
		pos[250] = {125,174}
		pos[251] = {108,181}
		pos[252] = {126,92}
		pos[253] = {116,98}
		pos[254] = {196,162}
		pos[255] = {122,126}
		pos[256] = {190,166}
		pos[257] = {220,69}
		pos[258] = {113,70}
	return math.ceil(pos[str][1]*100), math.ceil(pos[str][2]*100)
end

