function config(map)
    MapCanSavePos(map, 0)
    MapCanPK(map, 1)
    MapCanTeam( map, 0 )
    MapType( map , 3 )
    MapCopyNum(map, 1)
    SingleMapCopyPlyNum(map, 300)
    --MapCanTeam(map , 1)
    MapCanStall(map , 0)
	--	SetCopySpecialInter(map_copy, 1000)
end


function get_map_entry_pos_darkblue2()

	local POS_X = 1370
	local POS_Y = 532
	return POS_X, POS_Y

end

function init_entry(map)
	SetMapEntryMapName(map, "darkblue")
-- Установка времени работы карты
-- 2020/02/23/1/0 (год/месяц/день/часы/минуты) - время начала работы карты
-- 0/1/0  (день/час/минута) - время открытия портала (открываем ежечасно)
-- 0/0/30 (день/час/минута) - время работы портала (портал работает 30 минут)
-- 0/0/45 (день/час/минута) - время работы карты (карта работает 45 минут)
	SetMapEntryTime( map, "2020/02/23/0/0", "0/1/0", "0/0/30", "0/0/45" )
end

function map_run_darkblue2(map)
	
end

function can_open_entry_darkblue2(map)
	if (Open_portal_chaos == 2) then
		local Now_Time = GetNowTime()
		if Now_Time == 14 or Now_Time == 20 then
			return 1
		else
			return 0
		end
	else
		return 0
	end
end

function after_enter_darkblue2(role, map_copy)

end

function before_leave_darkblue2(role)
	
end	

function map_copy_run_darkblue2(map_copy)
		
end

function map_copy_run_special_darkblue2(map_copy) 
	local Icicle_players = GetMapActivePlayer(map_copy)
	Notice( "\194 \213\224\238\241\229 \203\229\228\251\237\232 "..Icicle_players.." \226\251\230\232\226\248\232\245!" )
	--Notice( "В Хаосе Ледыни "..Icicle_players.." выживших!" )
	Icicle_5_minute = Icicle_5_minute+1

	if (Icicle_5_minute == 2) then
		--Сундук Хаоса нач. ур. (ID 859)
		for i = 1, 14, 1 do 
			local angle = math.random(1,360)
			local x, y = IcicleChestPosition(i)
			local Monster = CreateChaEx(859, x, y, angle, 60, map_copy)
				SetChaLifeTime(Monster, 298050)
		end
		--Notice("\213\224\238\241 \203\229\228\251\237\232: \211\226\224\230\224\229\236\251\229 \239\232\240\224\242\251, \239\238\255\226\232\235\232\241\252 \241\243\237\228\243\234\232 \239\229\240\226\238\227\238 \243\240\238\226\237\255!")
		--Notice("Хаос Ледыни: Уважаемые пираты, появились сундуки первого уровня!")
		
		GM_Chat('\211\226\224\230\224\229\236\251\229 \239\232\240\224\242\251, \239\238 \239\238\241\235\229\228\237\232\236 \241\238\238\225\249\229\237\232\229\236 \226 \213\224\238\241\229 \238\241\242\224\235\238\241\252 '..Icicle_players..' '..phrase_no_dead(Icicle_players)..', \224 \242\224\234 \230\229 \238 \239\238\255\226\235\229\237\232\232 \241\243\237\228\243\234\238\226 \245\224\238\241\224 \237\224\247\224\235\252\237\238\227\238 \243\240\238\226\229\237\255!')
		--GM_Chat('Уважаемые пираты, по последним сообщением в Хаосе осталось '..Icicle_players..' '..phrase_no_dead(Icicle_players)..', а так же о появлении сундуков хаоса начального уровеня!')
	end
	
	if (Icicle_5_minute == 3) then
		--Сундук Хаоса стандартный ур. (ID 860
		for i = 1, 7, 1 do 
			local angle = math.random(1,360)
			local x, y = IcicleChestPosition(i)
			local Monster = CreateChaEx(860, x, y, angle, 60, map_copy)
				SetChaLifeTime(Monster, 298050)
		end
		--Notice("\213\224\238\241 \203\229\228\251\237\232: \211\226\224\230\224\229\236\251\229 \239\232\240\224\242\251, \239\238\255\226\232\235\232\241\252 \241\243\237\228\243\234\232 \226\242\238\240\238\227\238 \243\240\238\226\237\255!")
		--Notice("Хаос Ледыни: Уважаемые пираты, появились сундуки второго уровня!")
		
		GM_Chat('\211\226\224\230\224\229\236\251\229 \239\232\240\224\242\251, \239\238 \239\238\241\235\229\228\237\232\236 \241\238\238\225\249\229\237\232\229\236 \226 \213\224\238\241\229 \238\241\242\224\235\238\241\252 '..Icicle_players..' '..phrase_no_dead(Icicle_players)..', \224 \242\224\234 \230\229 \238 \239\238\255\226\235\229\237\232\232 \241\243\237\228\243\234\238\226 \245\224\238\241\224 \241\242\224\237\228\224\240\242\237\238\227\238 \243\240\238\226\229\237\255!')	
		--GM_Chat('Уважаемые пираты, по последним сообщением в Хаосе осталось '..Icicle_players..' '..phrase_no_dead(Icicle_players)..', а так же о появлении сундуков хаоса стандартного уровеня!')
	end
	
	if (Icicle_5_minute == 4) then
		--Сундук Хаоса эксперт ур. (ID 861)
		for i = 1, 7, 1 do 
			local angle = math.random(1,360)
			local x, y = IcicleChestPosition(i)
			local Monster = CreateChaEx(861, x, y, angle, 60, map_copy)
				SetChaLifeTime(Monster, 298050)
		end
		--Notice("\213\224\238\241 \203\229\228\251\237\232: \211\226\224\230\224\229\236\251\229 \239\232\240\224\242\251, \239\238\255\226\232\235\232\241\252 \241\243\237\228\243\234\232 \242\240\229\242\252\229\227\238 \243\240\238\226\237\255!")
		--Notice("Хаос Ледыни: Уважаемые пираты, появились сундуки третьего уровня!")
	
		GM_Chat('\211\226\224\230\224\229\236\251\229 \239\232\240\224\242\251, \239\238 \239\238\241\235\229\228\237\232\236 \241\238\238\225\249\229\237\232\229\236 \226 \213\224\238\241\229 \238\241\242\224\235\238\241\252 '..Icicle_players..' '..phrase_no_dead(Icicle_players)..', \224 \242\224\234 \230\229 \238 \239\238\255\226\235\229\237\232\232 \241\243\237\228\243\234\238\226 \245\224\238\241\224 \226\251\241\238\234\238\227\238 \243\240\238\226\229\237\255!')
		--GM_Chat('Уважаемые пираты, по последним сообщением в Хаосе осталось '..Icicle_players..' '..phrase_no_dead(Icicle_players)..', а так же о появлении сундуков хаоса высокого уровеня!')
	end
	
	-- Новайс мобы
	if (Icicle_5_minute == 5) then
		for i = 1, 89, 1 do
			local monster_id = {868,872,875,879}
			local x, y = IcicleMonsterPosition(i)
			local Monster = CreateChaEx(monster_id[math.random(1,4)], x, y, math.random(1,360), 60, map_copy)
				SetChaLifeTime(Monster, 298050)
		end
		--Notice("\213\224\238\241 \203\229\228\251\237\232: \194\238\231\240\224\228\232\235\232\241\252 \212\224\237\242\238\236\251 \232 \207\240\232\231\240\224\234\232...")
		--Notice("Хаос Ледыни: Возрадились Фантомы и Призраки...")
	
		GM_Chat('\211\226\224\230\224\229\236\251\229 \239\232\240\224\242\251, \239\238 \239\238\241\235\229\228\237\232\236 \241\238\238\225\249\229\237\232\229\236 \226 \213\224\238\241\229 \238\241\242\224\235\238\241\252 '..Icicle_players..' '..phrase_no_dead(Icicle_players)..', \224 \242\224\234 \230\229 \238 \239\238\255\226\235\229\237\232\232 \212\224\237\242\238\236\238\226 \232 \207\240\232\231\240\224\234\238\226 \237\224\247\224\235\252\237\238\227\238 \243\240\238\226\237\255!')
		--GM_Chat('Уважаемые пираты, по последним сообщением в Хаосе осталось '..Icicle_players..' '..phrase_no_dead(Icicle_players)..', а так же о появлении Фантомов и Призраков начального уровня!')
	end
	
	-- Мобы с первой профой
	if (Icicle_5_minute == 6) then
		for i = 1, 89, 1 do
			local monster_id = {869,873,876,880}
			local x, y = IcicleMonsterPosition(i)
			local Monster = CreateChaEx(monster_id[math.random(1,4)], x, y, math.random(1,360), 60, map_copy)
				SetChaLifeTime(Monster, 298050)
		end
		--Notice("\213\224\238\241 \203\229\228\251\237\232: \194\238\231\240\224\228\232\235\232\241\252 \212\224\237\242\238\236\251, \226\239\229\240\229\228! \194 \224\242\224\234\243!")
		--Notice("Хаос Ледыни: Возрадились Фантомы, вперед! В атаку!")
		
		GM_Chat('\211\226\224\230\224\229\236\251\229 \239\232\240\224\242\251, \239\238 \239\238\241\235\229\228\237\232\236 \241\238\238\225\249\229\237\232\229\236 \226 \213\224\238\241\229 \238\241\242\224\235\238\241\252 '..Icicle_players..' '..phrase_no_dead(Icicle_players)..', \224 \242\224\234 \230\229 \238 \239\238\255\226\235\229\237\232\232 \212\224\237\242\238\236\238\226!')
		--GM_Chat('Уважаемые пираты, по последним сообщением в Хаосе осталось '..Icicle_players..' '..phrase_no_dead(Icicle_players)..', а так же о появлении Фантомов!')
	end
	
	-- НГ мобы
	if (Icicle_5_minute == 7) then
		for i = 1, 120, 1 do
			local monster_id = {870,874,877,881}
			local x, y = IcicleMonsterPosition(i)
			local Monster = CreateChaEx(monster_id[math.random(1,4)], x, y, math.random(1,360), 60, map_copy)
				SetChaLifeTime(Monster, 298050)
		end
		--Notice("\213\224\238\241 \203\229\228\251\237\232: \194\238\231\240\224\228\232\235\232\241\252 \207\240\232\231\240\224\234\232, \225\243\228\252\242\229 \238\241\242\238\240\238\230\237\229\233...")
		--Notice("Хаос Ледыни: Возрадились Призраки, будьте осторожней...")
		
		GM_Chat('\211\226\224\230\224\229\236\251\229 \239\232\240\224\242\251, \239\238 \239\238\241\235\229\228\237\232\236 \241\238\238\225\249\229\237\232\229\236 \226 \213\224\238\241\229 \238\241\242\224\235\238\241\252 '..Icicle_players..' '..phrase_no_dead(Icicle_players)..', \224 \242\224\234 \230\229 \238 \239\238\255\226\235\229\237\232\232 \207\240\232\231\240\224\234\238\226!')
		--GM_Chat('Уважаемые пираты, по последним сообщением в Хаосе осталось '..Icicle_players..' '..phrase_no_dead(Icicle_players)..', а так же о появлении Призраков!')
	end
	
	-- БД Мобы
	if (Icicle_5_minute == 8) then
		for i = 1, 165, 1 do
			local monster_id = {883,884,885,886}
			local x, y = IcicleMonsterPosition(i)
			local Monster = CreateChaEx(monster_id[math.random(1,4)], x, y, math.random(1,360), 60, map_copy)
				SetChaLifeTime(Monster, 298050)
		end
		--Notice("\213\224\238\241 \203\229\228\251\237\232: \193\229\240\229\227\232\242\229\241\252 \239\232\240\224\242\251! \207\238\255\226\232\235\232\241\252 \241\238\240\224\242\237\232\234\232 \215\229\240\237\238\227\238 \196\240\224\234\238\237\224!")
		--Notice("Хаос Ледыни: Берегитесь пираты! Появились соратники Черного Дракона!")
	
		GM_Chat('\211\226\224\230\224\229\236\251\229 \239\232\240\224\242\251, \239\238 \239\238\241\235\229\228\237\232\236 \241\238\238\225\249\229\237\232\229\236 \226 \213\224\238\241\229 \238\241\242\224\235\238\241\252 '..Icicle_players..' '..phrase_no_dead(Icicle_players)..', \224 \242\224\234 \230\229 \238 \239\238\255\226\235\229\237\232\232 \241\238\240\224\242\237\232\234\238\226 \215\229\240\237\238\227\238 \196\240\224\234\238\237\224!')
		--GM_Chat('Уважаемые пираты, по последним сообщением в Хаосе осталось '..Icicle_players..' '..phrase_no_dead(Icicle_players)..', а так же о появлении соратников Черного Дракона!')
	end
	
	if (Icicle_5_minute == 9) then
		--Notice("\213\224\238\241 \203\229\228\251\237\232: \209\232\235\251 \245\224\238\241\224 \238\242\241\242\243\239\224\254\242! \194 \225\224\237\234\229 \213\224\238\241\224 \241\234\238\239\232\235\238\241\252 ["..Icicle_prize_money.."] \231\238\235\238\242\224. \202\242\238 \230\229 \231\224\225\229\240\229\242 \241\229\225\229 \237\224\227\240\224\228\243?")
		--Notice("Хаос Ледыни: Силы хаоса отступают! В банке Хаоса скопилось ["..Icicle_prize_money.."] золота. Кто же заберет себе награду?")
		
		GM_Chat('\211\226\224\230\224\229\236\251\229 \239\232\240\224\242\251, \241\232\235\251 \245\224\238\241\224 \238\242\241\242\243\239\224\254\242! \194 \225\224\237\234\229 \213\224\238\241\224 \241\234\238\239\232\235\238\241\252 ['..Icicle_prize_money..'] \231\238\235\238\242\224. \202\242\238 \230\229 \232\231 '..Icicle_players..' \232\227\240\238\234\238\226 \231\224\225\229\240\229\242 \241\229\225\229 \237\224\227\240\224\228\243?')
		--GM_Chat('Уважаемые пираты, силы хаоса отступают! В банке Хаоса скопилось ['..Icicle_prize_money..'] золота. Кто же из '..Icicle_players..' игроков заберет себе награду?')
	end
end

function map_run_darkblue2(map_copy)

end

function map_copy_before_close_darkblue2(map_copy)
	Icicle_players = GetMapActivePlayer(map_copy)
	if Icicle_players > 0 then
		DealAllActivePlayerInMap(map_copy,"GiveSpecItemIcicle")
	end
	Icicle_players = 0
	Icicle_5_minute = 0
	Icicle_prize_money = 500000
	
	-- Установим значение, для открытия порталов Хаоса
	--	1: Хаос Аргента
	--	2: Хаос Ледыни
	--	3: Хаос Шайтана
	Open_portal_chaos = math.random(1, 3)
end

function map_copy_close_darkblue2(map_copy)
	ClearAllSubMapCha(map_copy)
end

function GiveSpecItemIcicle(role)
	if Icicle_players == 0 then
		GM_Chat('\213\238-\245\238-\245\238, \226 \253\242\238\236 \225\238\254 \239\238\225\229\228\232\235\232 \236\238\237\241\242\240\251...')
		--GM_Chat('Хо-хо-хо, в этом бою победили монстры...')
		return
	end
	
	local Money_darkblue2 = math.floor(Icicle_prize_money/Icicle_players)
	
	if Icicle_players > 5 then
		AddMoney (role, 0, Money_darkblue2)
		--SystemNotice(role, "\209\229\227\238\228\237\255 \226 \225\238\254 \225\251\235\238 "..Icicle_players.." \226\251\230\232\226\248\232\245, \234\224\230\228\251\233 \232\231 \237\232\245 \239\238\235\243\247\224\229\242 \239\238 $"..Money_darkblue2.."!")
		--SystemNotice(role, "Сегодня в бою было "..Icicle_players.." выживших, каждый из них получает по $"..Money_darkblue2.."!")
		
		GM_Chat('\209\229\227\238\228\237\255 \226 \225\238\254 \225\251\235\238 '..Icicle_players..' \226\251\230\232\226\248\232\245, \234\224\230\228\251\233 \232\231 \237\232\245 \239\238\235\243\247\224\229\242 \239\238 $'..Money_darkblue2..'!')
		--GM_Chat('Сегодня в бою было '..Icicle_players..' выживших, каждый из них получает по $'..Money_darkblue2..'!')
		return
	end

	if Icicle_players < 6 and Icicle_players > 1 then
		local Item_CanGet = GetChaFreeBagGridNum(role)
		if Item_CanGet <= 0 then
			GiveItemX(role, 0, 1031, 1, 4)
		else
			GiveItem(role, 0, 1031, 1, 4)
		end
		AddMoney(role, 0, Money_darkblue2 )
		--SystemNotice(role, "\213\224\238\241 \203\229\228\251\237\232: \209\229\227\238\228\237\255 \226 \225\238\254 \225\251\235\238 "..Icicle_players.." \226\251\230\232\226\248\232\245, \234\224\230\228\251\233 \232\231 \237\232\245 \239\238\235\243\247\224\229\242 \239\238 $"..Money_darkblue2.." \232 \239\238 \232 1 \209\226\255\242\238\233 \253\236\225\235\229\236\238\233 \234\238\235\252\246\224!")
		--SystemNotice(role, "Хаос Ледыни: Сегодня в бою было "..Icicle_players.." выживших, каждый из них получает по $"..Money_darkblue2.." и по и 1 Святой эмблемой кольца!")
		
		GM_Chat('\209\229\227\238\228\237\255 \226 \225\238\254 \225\251\235\238 '..Icicle_players..' \226\251\230\232\226\248\232\245, \234\224\230\228\251\233 \232\231 \237\232\245 \239\238\235\243\247\224\229\242 \239\238 $'..Money_darkblue2..' \232 \239\238 \232 1 \209\226\255\242\238\233 \253\236\225\235\229\236\238\233 \234\238\235\252\246\224!')
		--GM_Chat('Сегодня в бою было '..Icicle_players..' выживших, каждый из них получает по $'..Money_darkblue2..' и по и 1 Святой эмблемой кольца!')
		return
	end
	
	if Icicle_players == 1 then
		local Item_CanGet = GetChaFreeBagGridNum(role)
		if Item_CanGet <= 0 then
			GiveItemX(role, 0, 1032, 1, 4)
		else
			GiveItem(role , 0, 1032, 1, 4)
		end
		AddMoney(role, 0, Money_darkblue2)
		local cha_name = GetChaDefaultName(role)
		--Notice("\213\224\238\241 \203\229\228\251\237\232: \197\228\232\237\241\242\226\229\237\237\251\236 \226\251\230\232\226\248\232\236 \226 \241\229\227\238\228\237\255\248\237\229\236 \225\238\254 \255\226\235\255\229\242\241\255 "..cha_name.." \206\237 \239\238\235\243\247\232\235 $"..Money_darkblue2.." \232 1 \253\236\225\235\229\236\243 \202\238\240\238\235\255 \202\238\235\252\246\224!")
		--Notice("Хаос Ледыни: Единственным выжившим в сегодняшнем бою является "..cha_name.." Он получил $"..Money_darkblue2.." и 1 эмблему Короля Кольца!")
		
		GM_Chat('\197\228\232\237\241\242\226\229\237\237\251\236 \226\251\230\232\226\248\232\236 \226 \241\229\227\238\228\237\255\248\237\229\236 \225\238\254 \255\226\235\255\229\242\241\255 '..cha_name..' \206\237 \239\238\235\243\247\232\235 $'..Money_darkblue2..' \232 1 \253\236\225\235\229\236\243 \202\238\240\238\235\255 \202\238\235\252\246\224!')
		--GM_Chat('Единственным выжившим в сегодняшнем бою является '..cha_name..' Он получил $'..Money_darkblue2..' и 1 эмблему Короля Кольца!')
		return
	end
end

function IcicleChestPosition(str)
	local pos = {}
		pos[1] = {153,90}
		pos[2] = {127,145}
		pos[3] = {185,207}
		pos[4] = {77,224}
		pos[5] = {222,147}
		pos[6] = {80,80}
		pos[7] = {72,158}
		pos[8] = {234,229}
		pos[9] = {180,127}
		pos[10] = {212,92}
		pos[11] = {125,86}
		pos[12] = {147,228}
		pos[13] = {97,104}
		pos[14] = {156,62}
	return math.ceil(pos[str][1]*100), math.ceil(pos[str][2]*100)
end

function IcicleMonsterPosition(str)
	local pos = {}
		pos[1] = {74,117}
		pos[2] = {68,105}
		pos[3] = {91,80}
		pos[4] = {114,77}
		pos[5] = {82,85}
		pos[6] = {92,220}
		pos[7] = {169,228}
		pos[8] = {180,210}
		pos[9] = {183,155}
		pos[10] = {77,149}
		pos[11] = {133,107}
		pos[12] = {68,68}
		pos[13] = {71,92}
		pos[14] = {24, 50}
		pos[15] = {79,72}
		pos[16] = {81,111}
		pos[17] = {66,122}
		pos[18] = {80,135}
		pos[19] = {92,148}
		pos[20] = {67,156}
		pos[21] = {69,174}
		pos[22] = {82,167}
		pos[23] = {92,186}
		pos[24] = {71,193}
		pos[25] = {70,203}
		pos[26] = {83,215}
		pos[27] = {71,231}
		pos[28] = {110,225}
		pos[29] = {121,199}
		pos[30] = {133,213}
		pos[31] = {133,236}
		pos[32] = {148,213}
		pos[33] = {150,186}
		pos[34] = {164,115}
		pos[35] = {153,84}
		pos[36] = {149,91}
		pos[37] = {159,90}
		pos[38] = {153,100}
		pos[39] = {103,130}
		pos[40] = {115,159}
		pos[41] = {117,186}
		pos[42] = {132,187}
		pos[43] = {142,164}
		pos[44] = {165,142}
		pos[45] = {172,195}
		pos[46] = {167,152}
		pos[47] = {98,104}
		pos[48] = {118,102}
		pos[49] = {111,116}
		pos[50] = {236,183}
		pos[51] = {131,118}
		pos[52] = {150,132}
		pos[53] = {137,152}
		pos[54] = {99,172}
		pos[55] = {128,135}
		pos[56] = {170,72}
		pos[57] = {170,102}
		pos[58] = {170,167}
		pos[59] = {165,181}
		pos[60] = {163,212}
		pos[61] = {146,198}
		pos[62] = {189,161}
		pos[63] = {197,169}
		pos[64] = {189,186}
		pos[65] = {189,203}
		pos[66] = {216,204}
		pos[67] = {222,180}
		pos[68] = {223,159}
		pos[69] = {206,185}
		pos[70] = {209,142}
		pos[71] = {230,141}
		pos[72] = {237,203}
		pos[73] = {235,230}
		pos[74] = {212,235}
		pos[75] = {194,232}
		pos[76] = {195,222}
		pos[77] = {214,219}
		pos[78] = {65,142}
		pos[79] = {87,203}
		pos[80] = {93,232}
		pos[81] = {101,65}
		pos[82] = {107,83}
		pos[83] = {125,68}
		pos[84] = {126,80}
		pos[85] = {183,70}
		pos[86] = {179,80}
		pos[87] = {182,92}
		pos[88] = {181,111}
		pos[89] = {184,130}
		pos[90] = {146,240}
		pos[91] = {161,240}
		pos[92] = {178,241}
		pos[93] = {186,243}
		pos[94] = {203,238}
		pos[95] = {227,219}
		pos[96] = {209,161}
		pos[97] = {233,159}
		pos[98] = {125,93}
		pos[99] = {133,59}
		pos[100] = {147,60}
		pos[101] = {157,52}
		pos[102] = {167,60}
		pos[103] = {179,59}
		pos[104] = {180,140}
		pos[105] = {195,65}
		pos[106] = {209,67}
		pos[107] = {226,64}
		pos[108] = {213,79}
		pos[109] = {212,92}
		pos[110] = {213,104}
		pos[111] = {112,149}
		pos[112] = {127,161}
		pos[113] = {140,141}
		pos[114] = {145,118}
		pos[115] = {151,139}
		pos[116] = {155,165}
		pos[117] = {173,128}
		pos[118] = {170,92}
		pos[119] = {157,69}
		pos[120] = {138,74}
		pos[121] = {134,92}
		pos[122] = {138,119}
		pos[123] = {105,103}
		pos[124] = {87,60}
		pos[125] = {61,183}
		pos[126] = {67,215}
		pos[127] = {77,239}
		pos[128] = {63,233}
		pos[129] = {106,200}
		pos[130] = {118,174}
		pos[131] = {93,166}
		pos[132] = {100,179}
		pos[133] = {109,149}
		pos[134] = {106,213}
		pos[135] = {174,181}
		pos[136] = {182,199}
		pos[137] = {182,224}
		pos[138] = {160,226}
		pos[139] = {143,226}
		pos[140] = {139,207}
		pos[141] = {143,189}
		pos[142] = {161,185}
		pos[143] = {138,177}
		pos[144] = {203,210}
		pos[145] = {226,240}
		pos[146] = {239,220}
		pos[147] = {219,194}
		pos[148] = {214,175}
		pos[149] = {118,234}
		pos[150] = {124,205}
		pos[151] = {241,149}
		pos[152] = {243,128}
		pos[153] = {241,116}
		pos[154] = {242,99}
		pos[155] = {242,85}
		pos[156] = {237,71}
		pos[157] = {211,99}
		pos[158] = {213,75}
		pos[159] = {184,207}
		pos[160] = {240,110}
		pos[161] = {242,79}
		pos[162] = {145,62}
		pos[163] = {132,221}
		pos[164] = {77,181}
		pos[165] = {82,174}
	return math.ceil(pos[str][1]*100), math.ceil(pos[str][2]*100)
end
